package World;

public class Tile {
    /**
     * Да се създаде клас, който представя квадратно поле с размер 1х1метър от игралната карта. Класа трябва да
     * съхранява следната информация:
     * - Пореден номер на полето (без повтаряне)
     * - Координати на полето
     * - Плътност (дали може да се преминава през него): solid (плътно), transparent(свободно преминаване, пода на
     *   играланта карта), clip (блокира преминаване на създания, не блокира ефекти)
     * - Как изглежда полето (име на Sprite или път към изображение на харддиска)
     * - Допълнителна информация за изобразяването на полето, ако е нужна
     *
     * При подадена информация, обектът трябва да може да изпълнява следните функции:
     * - Да променя своята плътност и/или външен вид
     *
     *
     * Всички полета се съхраняват в масив, който да може да се обхожда и сортира чрез Stream API
     */
}
