package Renderer;

public class Sprite {
    /**
     * Да се напише програма, която съхранява следната информация:
     *
     * - Път до изображение на харддиска
     * - Наименование
     * - Самото изображение в обект от тип javafx.scene.image.Image
     * - Скорост на анимацията (кадри в секунда)
     * - Списък с именувани поредици от фреймове
     * - За всяка поредица - начален индекс, краен индекс, координати от основното изображение, координати до центъра на
     *   всеки фрейм от неговия горен ляв ъгъл
     *
     * При подадедн вход, програмата трябва да може да върне следния отговор:
     *
     * - Да зареди от харддиска текстов файл с информация за размера на всеки фрейм от основното изображение и да
     *   извлече нужните данни за създаване на списъка с именувани поредици от кадри (анимации)
     * - Да зареди основното изображение
     * - При подадено име на поредица, индекс на кадъра и посока на обекта (ако има посока) - кадъра в подходящ формат
     *   за изобразяване върху javafx.scene.canvas.GraphicsContext
     * - Информация за дължината на всяка именувана поредица, в брой кадри
     * - Информация за наличието на определена именувана поредица (true/false)
     *
     *
     * Примерен ред на изпълнение: програмата получава име на sprite sheet -> намира текстов файл с търсеното име в
     * папката с ресурси на играта -> зарежда файла и извлича нужната информация -> зарежда изображението, посочено във
     * файла -> създава масив от данни с информация за кадрите и именуваните поредици (отделните анимации)
     */
}
